app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE (name LIKE '%DZIDZIO%')
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fasdas"], ["title", "fasas"], ["content", "asdhajskfhaskdk"], ["created_at", "2018-11-21 07:47:09.724524"], ["updated_at", "2018-11-21 07:47:09.724524"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]
UPDATE `posts` SET `content` = 'Сіквел «Фантастичних звірів і де їх шукати», чиї події будуть розгортатися в Парижі. Дія другої частини відбуватиметься у 1927 році, через кілька місяців після подій оригіналу. Ґріндельвальд тікає з-під варти і збирає тих, хто вважає чарівників вищими за всіх не магічних істот. Єдиний, хто може зупинити його, це Албус Дамблдор. Раніше вони були друзями, але тепер опинились по різні боки барикад. Але Дамблдору не впоратися самотужки, тож він вирішує заручитися підтримкою свого колишнього учня Ньюта Скамандера. Захоплююча пригода знову об\'єднає Ньюта з Тіною, Квіні з Якобом та випробує їхню вірність одне одному.', `updated_at` = '2018-11-25 18:08:15' WHERE `posts`.`id` = 8
---
  def update
  @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update(post_params)